app/Controllers/Controller.php

SELECT *
FROM `apartment`
LEFT JOIN `site` ON `apartment`.`SiteID` = `site`.`SiteID`
LEFT JOIN `customer` ON `apartment`.`CustID` = `customer`.`CustID`
LEFT JOIN `office` ON `site`.`OfficeID` = `office`.`OfficeID`
LEFT JOIN `province` ON `office`.`ProvinceID` = `province`.`ProvinceID`
SELECT *
FROM `site`
SELECT *
FROM `customer`
---
    public function apartSelect()
    {
        $session = session();
        $data['officerid'] = $session->get('OfficerID');
        $data['officername'] = $session->get('OfficerName');
        $data['officeruname'] = $session->get('OfficerUName');
        $apart = new ApartmentModel();
        $site = new SiteModel();
        $cust = new CustomerModel();
        $officer = new OfficerModel();
        $data['apart'] = $apart
            ->join('site', 'apartment.SiteID = site.SiteID', 'left')
            ->join('customer', 'apartment.CustID = customer.CustID', 'left')
            ->join('office', 'site.OfficeID = office.OfficeID', 'left')
            ->join('province', 'office.ProvinceID = province.ProvinceID', 'left')->findAll();
        $data['site'] = $site->findAll();
        $data['cust'] = $cust->findAll();